# Execlを読み取る処理を作る
import openpyxl
from openpyxl.utils.dataframe import dataframe_to_rows
import pandas as pd
from datetime import datetime

if __name__ == '__main__':
    df_a = pd.read_excel("JRAdata.xlsx", sheet_name="A")
    print(df_a.columns)
    df_b = pd.read_excel("JRAdata.xlsx", sheet_name="B")
    print(df_b.columns)
    df_c = pd.read_excel("JRAdata.xlsx", sheet_name="C")
    print(df_c.columns)

    column_a = ['年月日', ' 開催場', '回', '日', 'レース', '発走時刻', 'レース名', '競争条件', '距離', '登録頭数',
                '芝／ダート', '1着馬番', '2着馬番', '3着馬番', '4着馬番', '5着馬番', '6着馬番', '同着用予備',
                '同着用予備.1', '同着用予備.2', '同着用予備.3', '同着用予備.4', '単勝1', '単勝2', '複勝1', '複勝2',
                '複勝3', '複勝4', '枠1', '枠1.1', '枠連配当1', '枠2', '枠2.1', '枠連配当2', '馬1',
                '馬1.1', '馬連配当1', '馬2', '馬2.1', '馬連配当2', 'ワイド1', 'ワイド1.1', 'ワイド配当1',
                'ワイド2', 'ワイド2.1', 'ワイド配当2', 'ワイド3', 'ワイド3.1', 'ワイド配当3', 'ワイド4',
                'ワイド4.1', 'ワイド配当4', 'ワイド5', 'ワイド5.1', 'ワイド配当5', '馬単1', '馬単1.1',
                '馬単配当1', '馬単2', '馬単2.1', '馬単配当2', '3連複1', '3連複1.1', '3連複1.2',
                '3連複配当1', '3連複2', '3連複2.1', '3連複2.2', '3連複配当2', '3連単1', '3連単1.1',
                '3連単1.2', '3連単配当1', '3連単2', '3連単2.1', '3連単2.2', '3連単配当2']

    column_b = ['年月日', ' 開催場', '回', '日', 'レース', '競争条件', '距離', '登録頭数', '発走時刻', '馬番',
                '枠番', '馬名', '騎手', '斤量', '減量', '調教師', '種牡馬', '母名', '馬主', '母父', '人気',
                'オッズ', '着順', '単勝', '複勝']

    column_c = ['年月日', '開催', '発走時刻', 'レースナンバー', '競争条件', '距離', '芝／ダート', '馬名', '馬主名',
                '調教師名', '父', '母', '母の父', '騎手']
